Revit 2027 API
BuiltInFailures.MassFailures.FloorRecreateFailedWarning Property
 The floor cannot be created because no suitable level in the target document can be found.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FloorRecreateFailedWarning { get; }
Public Shared ReadOnly Property FloorRecreateFailedWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FloorRecreateFailedWarning {
	FailureDefinitionId^ get ();
}
static member FloorRecreateFailedWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MassFailures Class
Autodesk.Revit.DB Namespace